[
  {
    "id": "bio-01",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Neurotransmitters",
    "stem": "Which neurotransmitter is most directly associated with the reward pathway and is implicated in substance use disorders?",
    "options": ["A. Serotonin", "B. Dopamine", "C. GABA", "D. Acetylcholine"],
    "correct_answer": "B. Dopamine",
    "explanation": "Dopamine is the primary neurotransmitter in the mesolimbic reward pathway (ventral tegmental area to nucleus accumbens). It plays a central role in reinforcement and is heavily implicated in substance use disorders. Serotonin (A) is primarily involved in mood regulation. GABA (C) is the main inhibitory neurotransmitter. Acetylcholine (D) is involved in muscle contraction and memory.",
    "difficulty": "easy"
  },
  {
    "id": "bio-02",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Brain Regions",
    "stem": "Damage to Broca's area most typically results in:",
    "options": ["A. Receptive aphasia with fluent but meaningless speech", "B. Expressive aphasia with nonfluent, effortful speech", "C. Inability to recognize familiar faces", "D. Loss of explicit long-term memory"],
    "correct_answer": "B. Expressive aphasia with nonfluent, effortful speech",
    "explanation": "Broca's area (left inferior frontal gyrus) controls speech production. Damage causes expressive (Broca's) aphasia — nonfluent, telegraphic speech with relatively preserved comprehension. Receptive aphasia (A) results from Wernicke's area damage. Prosopagnosia (C) involves fusiform gyrus damage. Explicit memory loss (D) involves hippocampal damage.",
    "difficulty": "easy"
  },
  {
    "id": "bio-03",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Psychopharmacology",
    "stem": "Selective serotonin reuptake inhibitors (SSRIs) exert their therapeutic effect primarily by:",
    "options": ["A. Increasing the synthesis of serotonin in presynaptic neurons", "B. Blocking the reabsorption of serotonin into the presynaptic neuron", "C. Directly stimulating postsynaptic serotonin receptors", "D. Inhibiting monoamine oxidase enzymes"],
    "correct_answer": "B. Blocking the reabsorption of serotonin into the presynaptic neuron",
    "explanation": "SSRIs work by selectively blocking the serotonin transporter, preventing reuptake of serotonin from the synaptic cleft back into the presynaptic neuron, thereby increasing serotonin availability. They do not increase synthesis (A), directly stimulate receptors (C), or inhibit MAO (D) — MAO inhibitors are a separate class of antidepressants.",
    "difficulty": "easy"
  },
  {
    "id": "bio-04",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Neuroanatomy",
    "stem": "The hypothalamus is most directly involved in regulating all of the following EXCEPT:",
    "options": ["A. Body temperature", "B. Hunger and thirst", "C. Language comprehension", "D. Circadian rhythms"],
    "correct_answer": "C. Language comprehension",
    "explanation": "The hypothalamus regulates homeostatic functions including body temperature (A), hunger and thirst (B), and circadian rhythms (D) via the suprachiasmatic nucleus. Language comprehension (C) is a cortical function primarily associated with Wernicke's area in the temporal lobe.",
    "difficulty": "easy"
  },
  {
    "id": "bio-05",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Psychopharmacology",
    "stem": "A patient taking a first-generation (typical) antipsychotic develops involuntary repetitive movements of the tongue and face after prolonged use. This condition is most likely:",
    "options": ["A. Neuroleptic malignant syndrome", "B. Tardive dyskinesia", "C. Akathisia", "D. Dystonia"],
    "correct_answer": "B. Tardive dyskinesia",
    "explanation": "Tardive dyskinesia involves involuntary, repetitive movements (especially of the face, tongue, and jaw) that develop after prolonged use of dopamine-blocking antipsychotics. Neuroleptic malignant syndrome (A) is a life-threatening condition with fever, rigidity, and autonomic instability. Akathisia (C) is restlessness/inability to sit still. Dystonia (D) involves sustained muscle contractions, typically early in treatment.",
    "difficulty": "medium"
  },
  {
    "id": "bio-06",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Hormones",
    "stem": "Prolonged elevation of cortisol due to chronic stress has been most consistently associated with damage to the:",
    "options": ["A. Cerebellum", "B. Hippocampus", "C. Occipital lobe", "D. Corpus callosum"],
    "correct_answer": "B. Hippocampus",
    "explanation": "The hippocampus has a high density of glucocorticoid receptors and is particularly vulnerable to the neurotoxic effects of prolonged cortisol elevation, leading to dendritic atrophy and impaired neurogenesis. This has implications for memory and is relevant to PTSD and depression research. The cerebellum (A), occipital lobe (C), and corpus callosum (D) are not primary targets of cortisol-mediated damage.",
    "difficulty": "medium"
  },
  {
    "id": "bio-07",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Genetics",
    "stem": "The concept of epigenetics is best described as:",
    "options": ["A. Changes in gene expression that do not involve alterations to the DNA sequence", "B. The study of how genes are transmitted across generations via Mendelian inheritance", "C. Mutations in DNA that produce new alleles in a population", "D. The mapping of the entire human genome"],
    "correct_answer": "A. Changes in gene expression that do not involve alterations to the DNA sequence",
    "explanation": "Epigenetics refers to heritable changes in gene expression (e.g., through DNA methylation or histone modification) that occur without changes to the underlying DNA sequence. Environmental factors like stress can produce epigenetic changes. Mendelian inheritance (B) is classical genetics. Mutations (C) involve DNA sequence changes. Genome mapping (D) refers to the Human Genome Project.",
    "difficulty": "medium"
  },
  {
    "id": "bio-08",
    "domain": "Biological Bases of Behavior",
    "domain_num": 1,
    "topic": "Neurotransmitters",
    "stem": "A deficiency in acetylcholine is most strongly associated with which condition?",
    "options": ["A. Parkinson's disease", "B. Schizophrenia", "C. Alzheimer's disease", "D. Major depressive disorder"],
    "correct_answer": "C. Alzheimer's disease",
    "explanation": "Alzheimer's disease is associated with degeneration of cholinergic neurons in the basal forebrain (nucleus basalis of Meynert), leading to acetylcholine deficiency. This is why cholinesterase inhibitors (e.g., donepezil) are used as treatment. Parkinson's (A) primarily involves dopamine deficiency. Schizophrenia (B) involves dopamine dysregulation. Depression (D) involves serotonin and norepinephrine.",
    "difficulty": "medium"
  },
  {
    "id": "cog-01",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Classical Conditioning",
    "stem": "In classical conditioning, a previously neutral stimulus that has been paired with an unconditioned stimulus and now elicits a conditioned response is called the:",
    "options": ["A. Unconditioned stimulus", "B. Unconditioned response", "C. Conditioned stimulus", "D. Discriminative stimulus"],
    "correct_answer": "C. Conditioned stimulus",
    "explanation": "A conditioned stimulus (CS) is a previously neutral stimulus that, after repeated pairing with an unconditioned stimulus (UCS), comes to elicit a conditioned response. The unconditioned stimulus (A) naturally elicits a response. The unconditioned response (B) is the natural reaction. A discriminative stimulus (D) is an operant conditioning concept signaling reinforcement availability.",
    "difficulty": "easy"
  },
  {
    "id": "cog-02",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Operant Conditioning",
    "stem": "A child throws a tantrum in a store, and the parent buys the child a toy to stop the tantrum. The parent's behavior of buying the toy is maintained by:",
    "options": ["A. Positive reinforcement", "B. Negative reinforcement", "C. Positive punishment", "D. Negative punishment"],
    "correct_answer": "B. Negative reinforcement",
    "explanation": "The parent's toy-buying behavior is strengthened because it removes an aversive stimulus (the tantrum) — this is negative reinforcement. Positive reinforcement (A) would involve adding a pleasant stimulus. Note that the child's tantrum behavior is positively reinforced (getting a toy). Positive punishment (C) adds an aversive. Negative punishment (D) removes a pleasant stimulus.",
    "difficulty": "medium"
  },
  {
    "id": "cog-03",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Memory Models",
    "stem": "According to the Atkinson-Shiffrin model, information must pass through which sequence of memory stores?",
    "options": ["A. Long-term memory → short-term memory → sensory memory", "B. Sensory memory → short-term memory → long-term memory", "C. Working memory → episodic buffer → long-term memory", "D. Procedural memory → declarative memory → semantic memory"],
    "correct_answer": "B. Sensory memory → short-term memory → long-term memory",
    "explanation": "The Atkinson-Shiffrin (1968) multi-store model proposes that information flows from sensory memory (brief storage) to short-term memory (limited capacity, ~20 seconds) to long-term memory through rehearsal. Option C describes components of Baddeley's working memory model. Option D conflates different types of long-term memory.",
    "difficulty": "easy"
  },
  {
    "id": "cog-04",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Cognitive Theories",
    "stem": "According to Vygotsky, the zone of proximal development (ZPD) refers to:",
    "options": ["A. The stage at which a child can perform tasks independently", "B. The gap between what a child can do alone and what they can do with assistance", "C. The critical period for language acquisition", "D. The sensorimotor stage of cognitive development"],
    "correct_answer": "B. The gap between what a child can do alone and what they can do with assistance",
    "explanation": "Vygotsky's ZPD is the distance between a child's actual developmental level (independent problem-solving) and potential developmental level (problem-solving with guidance from a more knowledgeable other). This concept emphasizes the social nature of learning. Option A describes actual development. Option C relates to Chomsky/Lenneberg. Option D is Piaget's first stage.",
    "difficulty": "easy"
  },
  {
    "id": "cog-05",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Learning",
    "stem": "In Albert Bandura's social learning theory, which of the following is NOT one of the processes required for observational learning?",
    "options": ["A. Attention", "B. Retention", "C. Reinforcement of the observer", "D. Reproduction"],
    "correct_answer": "C. Reinforcement of the observer",
    "explanation": "Bandura identified four processes in observational learning: attention, retention, reproduction (motor), and motivation. Notably, direct reinforcement of the observer is NOT required — learning can occur through vicarious reinforcement (observing the model being reinforced). This distinguished social learning theory from traditional behaviorism.",
    "difficulty": "medium"
  },
  {
    "id": "cog-06",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Emotion",
    "stem": "The James-Lange theory of emotion proposes that:",
    "options": ["A. Emotional experience and physiological arousal occur simultaneously", "B. Physiological arousal precedes and causes the emotional experience", "C. Cognitive appraisal determines the emotional experience independent of arousal", "D. Emotions are the result of facial feedback from muscle movements"],
    "correct_answer": "B. Physiological arousal precedes and causes the emotional experience",
    "explanation": "The James-Lange theory states that we experience emotion as a result of physiological changes — we feel sad because we cry, not the other way around. The Cannon-Bard theory (A) proposes simultaneous arousal and emotion. Schachter-Singer's two-factor theory emphasizes cognitive labeling of arousal. The facial feedback hypothesis (D) is a related but distinct theory.",
    "difficulty": "medium"
  },
  {
    "id": "cog-07",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Perception",
    "stem": "Weber's Law states that:",
    "options": ["A. The absolute threshold for detection is constant across all stimulus intensities", "B. The just noticeable difference (JND) is a constant proportion of the original stimulus", "C. Sensory adaptation occurs at a fixed rate regardless of stimulus type", "D. Signal detection depends solely on the physical intensity of the stimulus"],
    "correct_answer": "B. The just noticeable difference (JND) is a constant proportion of the original stimulus",
    "explanation": "Weber's Law states that the JND (the minimum change needed to detect a difference) is proportional to the magnitude of the original stimulus. For example, if the Weber fraction for weight is 1/50, you would need a 1-pound change to detect a difference in a 50-pound object. This is foundational in psychophysics.",
    "difficulty": "medium"
  },
  {
    "id": "cog-08",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Cognitive Theories",
    "stem": "According to Piaget, a child who understands that the amount of water remains the same when poured from a short, wide glass into a tall, narrow glass has achieved:",
    "options": ["A. Object permanence", "B. Conservation", "C. Formal operations", "D. Centration"],
    "correct_answer": "B. Conservation",
    "explanation": "Conservation is the understanding that certain properties (volume, mass, number) remain the same despite changes in appearance. It is a hallmark of the concrete operational stage (ages 7-11). Object permanence (A) develops in the sensorimotor stage. Formal operations (C) involves abstract reasoning. Centration (D) is the preoperational tendency to focus on one aspect, which leads to failure on conservation tasks.",
    "difficulty": "easy"
  },
  {
    "id": "cog-09",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Motivation",
    "stem": "According to self-determination theory (Deci & Ryan), intrinsic motivation is enhanced when which three basic psychological needs are met?",
    "options": ["A. Power, achievement, and affiliation", "B. Autonomy, competence, and relatedness", "C. Safety, belonging, and esteem", "D. Hunger, thirst, and sex"],
    "correct_answer": "B. Autonomy, competence, and relatedness",
    "explanation": "Self-determination theory (Deci & Ryan) identifies three innate psychological needs: autonomy (sense of choice), competence (sense of effectiveness), and relatedness (sense of connection). When these are met, intrinsic motivation flourishes. Option A describes McClelland's needs. Option C refers to Maslow's hierarchy. Option D describes biological drives.",
    "difficulty": "medium"
  },
  {
    "id": "cog-10",
    "domain": "Cognitive-Affective Bases of Behavior",
    "domain_num": 2,
    "topic": "Memory Models",
    "stem": "The 'levels of processing' framework proposed by Craik and Lockhart suggests that:",
    "options": ["A. Memory consists of three separate stores with different capacities", "B. Deeper, more meaningful processing of information leads to better retention", "C. Working memory has a central executive and two subsystems", "D. Memories are stored in specific brain locations corresponding to modality"],
    "correct_answer": "B. Deeper, more meaningful processing of information leads to better retention",
    "explanation": "Craik and Lockhart (1972) proposed that memory depends not on separate stores but on the depth of processing. Shallow processing (structural/phonemic features) produces weaker memory than deep processing (semantic meaning). Option A describes the multi-store model. Option C describes Baddeley's working memory model.",
    "difficulty": "medium"
  },
  {
    "id": "soc-01",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Social Psychology",
    "stem": "In Milgram's obedience studies, approximately what percentage of participants administered the maximum 450-volt shock?",
    "options": ["A. 10%", "B. 35%", "C. 65%", "D. 90%"],
    "correct_answer": "C. 65%",
    "explanation": "In Milgram's original (1963) obedience study, approximately 65% of participants delivered the maximum 450-volt shock when instructed by an authority figure. This surprisingly high rate demonstrated the power of obedience to authority and situational factors over individual disposition.",
    "difficulty": "easy"
  },
  {
    "id": "soc-02",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Social Psychology",
    "stem": "Solomon Asch's conformity experiments demonstrated that:",
    "options": ["A. People conform more when the group is unanimous", "B. Conformity rates are unaffected by group size beyond two members", "C. Participants never conformed to obviously incorrect judgments", "D. Private acceptance always accompanies public compliance"],
    "correct_answer": "A. People conform more when the group is unanimous",
    "explanation": "Asch found that conformity was highest when the confederate group was unanimous. When even one confederate gave the correct answer, conformity dropped dramatically. About 75% of participants conformed at least once, but many showed public compliance without private acceptance, distinguishing between normative and informational influence.",
    "difficulty": "medium"
  },
  {
    "id": "soc-03",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Personality Theories",
    "stem": "Which of the Big Five personality factors is most strongly associated with academic and job performance?",
    "options": ["A. Openness to Experience", "B. Agreeableness", "C. Conscientiousness", "D. Extraversion"],
    "correct_answer": "C. Conscientiousness",
    "explanation": "Research consistently shows that conscientiousness (organized, dependable, disciplined) is the strongest Big Five predictor of both academic performance and job performance across occupations. Openness (A) predicts creativity and training proficiency. Extraversion (D) predicts performance in sales/management. Agreeableness (B) predicts teamwork but is less predictive of overall performance.",
    "difficulty": "medium"
  },
  {
    "id": "soc-04",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Social Cognition",
    "stem": "The fundamental attribution error refers to the tendency to:",
    "options": ["A. Attribute one's own behavior to dispositional factors", "B. Overestimate situational factors when explaining others' behavior", "C. Overestimate dispositional factors when explaining others' behavior", "D. Attribute others' success to luck and failure to character"],
    "correct_answer": "C. Overestimate dispositional factors when explaining others' behavior",
    "explanation": "The fundamental attribution error (Ross, 1977) is the tendency to overemphasize internal/dispositional explanations for others' behavior while underestimating situational influences. For our own behavior, we tend to make situational attributions (actor-observer bias). Note this bias is more prominent in individualistic cultures.",
    "difficulty": "easy"
  },
  {
    "id": "soc-05",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Cultural Psychology",
    "stem": "Sue and Sue's model of cultural competence emphasizes that culturally competent therapists need all of the following EXCEPT:",
    "options": ["A. Awareness of their own cultural values and biases", "B. Knowledge of the worldviews of culturally diverse clients", "C. Mastery of the client's native language", "D. Development of culturally appropriate intervention strategies"],
    "correct_answer": "C. Mastery of the client's native language",
    "explanation": "Sue and Sue's tripartite model of multicultural competence includes: (1) awareness of one's own assumptions and biases, (2) understanding the worldview of culturally diverse clients, and (3) developing appropriate intervention strategies and techniques. While language considerations are important, mastery of the client's native language is not a requirement — interpreters and referrals may be used.",
    "difficulty": "medium"
  },
  {
    "id": "soc-06",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Social Psychology",
    "stem": "Zimbardo's Stanford Prison Experiment is most often cited to illustrate:",
    "options": ["A. The bystander effect in emergency situations", "B. The power of social roles and situational forces on behavior", "C. The influence of cognitive dissonance on attitude change", "D. The effect of group polarization on decision-making"],
    "correct_answer": "B. The power of social roles and situational forces on behavior",
    "explanation": "Zimbardo's 1971 study demonstrated how quickly normal individuals adopted abusive (guards) or passive (prisoners) behaviors when assigned social roles, illustrating the power of situational forces. The bystander effect (A) was studied by Darley & Latané. Cognitive dissonance (C) was Festinger's work. Group polarization (D) is a separate phenomenon.",
    "difficulty": "easy"
  },
  {
    "id": "soc-07",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Personality Theories",
    "stem": "The MMPI-2 validity scale that measures a test-taker's tendency to present themselves in an overly favorable light is the:",
    "options": ["A. F scale", "B. L (Lie) scale", "C. K scale", "D. VRIN scale"],
    "correct_answer": "B. L (Lie) scale",
    "explanation": "The L (Lie) scale on the MMPI-2 detects unsophisticated attempts to present oneself in a favorable light by endorsing items that claim overly virtuous behaviors. The F scale detects unusual/infrequent responses. The K scale is a more subtle measure of defensiveness. VRIN measures inconsistent responding.",
    "difficulty": "medium"
  },
  {
    "id": "soc-08",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Social Psychology",
    "stem": "Cognitive dissonance theory (Festinger) predicts that a person who is paid a small amount to lie about enjoying a boring task will:",
    "options": ["A. Experience no attitude change", "B. Rate the task as more enjoyable than someone paid a large amount", "C. Rate the task as less enjoyable than someone paid a large amount", "D. Refuse to change their attitude regardless of payment"],
    "correct_answer": "B. Rate the task as more enjoyable than someone paid a large amount",
    "explanation": "According to cognitive dissonance theory, insufficient justification (small payment) creates greater dissonance between behavior (lying) and attitude (boring), motivating attitude change. Those paid a large amount have sufficient external justification and experience less dissonance, thus less attitude change. This was demonstrated in Festinger and Carlsmith's (1959) classic study.",
    "difficulty": "hard"
  },
  {
    "id": "soc-09",
    "domain": "Social and Cultural Bases of Behavior",
    "domain_num": 3,
    "topic": "Social Cognition",
    "stem": "The just-world hypothesis predicts that people will:",
    "options": ["A. Assume that the world is fundamentally unfair and random", "B. Blame victims for their misfortune to maintain a belief in fairness", "C. Attribute all outcomes to systemic factors", "D. Empathize more with victims of random crimes"],
    "correct_answer": "B. Blame victims for their misfortune to maintain a belief in fairness",
    "explanation": "Lerner's just-world hypothesis suggests people need to believe the world is fair and that people get what they deserve. When confronted with innocent victims, people may derogate victims to preserve this belief — 'they must have done something to deserve it.' This has implications for understanding attitudes toward victims of crime, poverty, and illness.",
    "difficulty": "medium"
  },
  {
    "id": "dev-01",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Erikson's Stages",
    "stem": "According to Erikson, the psychosocial crisis of adolescence is:",
    "options": ["A. Industry vs. Inferiority", "B. Identity vs. Role Confusion", "C. Intimacy vs. Isolation", "D. Generativity vs. Stagnation"],
    "correct_answer": "B. Identity vs. Role Confusion",
    "explanation": "Erikson's fifth stage, Identity vs. Role Confusion, occurs during adolescence (12-18 years). The primary task is developing a sense of self and personal identity. Industry vs. Inferiority (A) is the school-age stage. Intimacy vs. Isolation (C) is young adulthood. Generativity vs. Stagnation (D) is middle adulthood.",
    "difficulty": "easy"
  },
  {
    "id": "dev-02",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Attachment Theory",
    "stem": "In Ainsworth's Strange Situation, an infant who shows distress upon separation but is quickly comforted upon the caregiver's return demonstrates which attachment style?",
    "options": ["A. Secure attachment", "B. Anxious-avoidant attachment", "C. Anxious-resistant/ambivalent attachment", "D. Disorganized attachment"],
    "correct_answer": "A. Secure attachment",
    "explanation": "Securely attached infants use the caregiver as a secure base, show distress at separation, and are readily comforted upon reunion. Anxious-avoidant (B) infants show little distress at separation and avoid the caregiver. Anxious-resistant (C) infants are very distressed and difficult to comfort, showing ambivalence. Disorganized (D) infants show contradictory approach-avoidance behaviors.",
    "difficulty": "easy"
  },
  {
    "id": "dev-03",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Kohlberg's Moral Development",
    "stem": "A child who says 'I shouldn't steal because I might get caught and punished' is reasoning at which of Kohlberg's levels?",
    "options": ["A. Preconventional — Stage 1", "B. Conventional — Stage 3", "C. Conventional — Stage 4", "D. Postconventional — Stage 5"],
    "correct_answer": "A. Preconventional — Stage 1",
    "explanation": "Stage 1 (Punishment and Obedience Orientation) of Kohlberg's preconventional level is characterized by decisions based on avoiding punishment. Stage 3 (B) focuses on gaining approval ('good boy/good girl'). Stage 4 (C) emphasizes maintaining social order. Stage 5 (D) considers social contracts and individual rights.",
    "difficulty": "easy"
  },
  {
    "id": "dev-04",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Cognitive Development",
    "stem": "According to Piaget, the ability to think abstractly and hypothetically emerges during which stage?",
    "options": ["A. Sensorimotor", "B. Preoperational", "C. Concrete operational", "D. Formal operational"],
    "correct_answer": "D. Formal operational",
    "explanation": "The formal operational stage (beginning around age 11-12) is characterized by abstract thinking, hypothetical-deductive reasoning, and the ability to consider possibilities beyond concrete reality. Sensorimotor (A) involves sensory exploration. Preoperational (B) involves symbolic thought but lacks logic. Concrete operational (C) involves logical thinking about concrete events.",
    "difficulty": "easy"
  },
  {
    "id": "dev-05",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Aging",
    "stem": "Research on cognitive aging most consistently shows that:",
    "options": ["A. Both fluid and crystallized intelligence decline equally with age", "B. Crystallized intelligence tends to remain stable or increase while fluid intelligence declines", "C. Fluid intelligence remains stable while crystallized intelligence declines", "D. Neither fluid nor crystallized intelligence shows significant change before age 80"],
    "correct_answer": "B. Crystallized intelligence tends to remain stable or increase while fluid intelligence declines",
    "explanation": "Cattell and Horn's research shows that crystallized intelligence (accumulated knowledge, vocabulary) tends to remain stable or even increase throughout adulthood, while fluid intelligence (novel problem-solving, processing speed) begins declining in the 20s-30s. This has important implications for neuropsychological assessment of older adults.",
    "difficulty": "medium"
  },
  {
    "id": "dev-06",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Attachment Theory",
    "stem": "According to Bowlby, the internal working model formed through early attachment experiences:",
    "options": ["A. Is fixed and unchangeable after the first year of life", "B. Influences expectations about relationships throughout the lifespan", "C. Only affects parent-child relationships, not peer or romantic relationships", "D. Is entirely determined by genetic temperament"],
    "correct_answer": "B. Influences expectations about relationships throughout the lifespan",
    "explanation": "Bowlby theorized that early attachment experiences create internal working models — mental representations of self and others — that serve as templates for future relationships. While these models tend to be stable, they can be updated through new relational experiences (e.g., therapy). They influence romantic, peer, and therapeutic relationships, not just parent-child bonds.",
    "difficulty": "medium"
  },
  {
    "id": "dev-07",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Development",
    "stem": "Harlow's research with rhesus monkeys demonstrated that:",
    "options": ["A. Attachment is primarily based on feeding", "B. Contact comfort is more important than feeding for attachment", "C. Monkeys cannot form attachments to inanimate objects", "D. Social isolation has no long-term effects if ended before 6 months"],
    "correct_answer": "B. Contact comfort is more important than feeding for attachment",
    "explanation": "Harlow's classic studies showed that infant monkeys preferred the cloth-covered 'mother' that provided contact comfort over the wire 'mother' that provided food. This challenged the drive-reduction theory of attachment (that infants bond to those who feed them) and demonstrated the primacy of contact comfort and security.",
    "difficulty": "easy"
  },
  {
    "id": "dev-08",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Erikson's Stages",
    "stem": "An elderly person reflecting on their life with a sense of fulfillment and acceptance is successfully resolving which of Erikson's stages?",
    "options": ["A. Generativity vs. Stagnation", "B. Intimacy vs. Isolation", "C. Integrity vs. Despair", "D. Identity vs. Role Confusion"],
    "correct_answer": "C. Integrity vs. Despair",
    "explanation": "Erikson's eighth and final stage, Integrity vs. Despair, occurs in late adulthood. Successful resolution involves looking back on life with satisfaction and wisdom, while failure leads to regret and despair. Generativity vs. Stagnation (A) is middle adulthood. Intimacy vs. Isolation (B) is young adulthood.",
    "difficulty": "easy"
  },
  {
    "id": "dev-09",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Gender Identity",
    "stem": "According to gender schema theory (Bem), children:",
    "options": ["A. Learn gender roles solely through operant conditioning", "B. Develop cognitive frameworks for organizing gender-related information from their culture", "C. Cannot understand gender until reaching formal operational thought", "D. Develop gender identity only through biological maturation"],
    "correct_answer": "B. Develop cognitive frameworks for organizing gender-related information from their culture",
    "explanation": "Sandra Bem's gender schema theory proposes that children develop cognitive schemas (mental frameworks) about gender from cultural messages, and these schemas then guide how they process and organize gender-relevant information, influencing behavior and self-concept. This integrates cognitive-developmental and social learning perspectives.",
    "difficulty": "medium"
  },
  {
    "id": "dev-10",
    "domain": "Growth and Lifespan Development",
    "domain_num": 4,
    "topic": "Development",
    "stem": "The concept of 'goodness of fit' in developmental psychology refers to:",
    "options": ["A. The match between a child's temperament and environmental demands", "B. The degree to which a child meets developmental milestones on time", "C. The compatibility between parents' intelligence and child's IQ", "D. The correlation between prenatal care and birth outcomes"],
    "correct_answer": "A. The match between a child's temperament and environmental demands",
    "explanation": "Thomas and Chess proposed that developmental outcomes depend on the 'goodness of fit' between a child's temperament (easy, difficult, slow-to-warm-up) and the demands and expectations of their environment. A 'difficult' child in a patient, flexible environment may thrive, while the same child in a rigid environment may develop problems.",
    "difficulty": "medium"
  },
  {
    "id": "assess-01",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Reliability",
    "stem": "A test that yields consistent results when administered on two separate occasions to the same group demonstrates high:",
    "options": ["A. Content validity", "B. Test-retest reliability", "C. Predictive validity", "D. Internal consistency"],
    "correct_answer": "B. Test-retest reliability",
    "explanation": "Test-retest reliability measures the consistency of scores over time by administering the same test to the same group on two occasions and correlating the scores. Content validity (A) refers to how well items represent the construct domain. Predictive validity (C) refers to how well scores predict future outcomes. Internal consistency (D) measures how well items within a test correlate.",
    "difficulty": "easy"
  },
  {
    "id": "assess-02",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Assessment Instruments",
    "stem": "The Wechsler Adult Intelligence Scale (WAIS) yields a Full Scale IQ with a mean of 100 and a standard deviation of 15. A person with a Full Scale IQ of 130 falls at approximately which percentile?",
    "options": ["A. 84th percentile", "B. 95th percentile", "C. 98th percentile", "D. 99.9th percentile"],
    "correct_answer": "C. 98th percentile",
    "explanation": "An IQ of 130 is 2 standard deviations above the mean (130 - 100 = 30; 30/15 = 2 SD). In a normal distribution, 2 SD above the mean corresponds to approximately the 97.7th percentile, which rounds to approximately the 98th percentile. One SD above (115) = 84th percentile. Three SD above (145) ≈ 99.9th percentile.",
    "difficulty": "medium"
  },
  {
    "id": "assess-03",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Validity",
    "stem": "A new depression scale that correlates highly with the Beck Depression Inventory demonstrates good:",
    "options": ["A. Face validity", "B. Predictive validity", "C. Convergent validity", "D. Discriminant validity"],
    "correct_answer": "C. Convergent validity",
    "explanation": "Convergent validity (a type of construct validity) is established when a test correlates highly with another test measuring the same construct. A new depression scale correlating with an established depression measure (BDI) demonstrates convergent validity. Face validity (A) is surface appearance. Predictive validity (B) involves future criteria. Discriminant validity (D) requires low correlations with measures of different constructs.",
    "difficulty": "medium"
  },
  {
    "id": "assess-04",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "DSM-5 Criteria",
    "stem": "According to the DSM-5, a diagnosis of Major Depressive Disorder requires symptoms to be present for a minimum of:",
    "options": ["A. 1 week", "B. 2 weeks", "C. 1 month", "D. 3 months"],
    "correct_answer": "B. 2 weeks",
    "explanation": "The DSM-5 requires five or more symptoms (including depressed mood or loss of interest/pleasure) to be present during the same 2-week period, representing a change from previous functioning. The 2-week criterion helps distinguish clinical depression from normal sadness or grief reactions.",
    "difficulty": "easy"
  },
  {
    "id": "assess-05",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Psychometrics",
    "stem": "The standard error of measurement (SEM) is used to:",
    "options": ["A. Determine if a test is biased against certain groups", "B. Estimate the range within which an individual's true score likely falls", "C. Calculate the correlation between two halves of a test", "D. Determine the content validity of a test"],
    "correct_answer": "B. Estimate the range within which an individual's true score likely falls",
    "explanation": "The SEM provides a confidence interval around an obtained score, estimating the range within which the true score likely falls. It is calculated using the standard deviation of the test and its reliability coefficient: SEM = SD × √(1 - reliability). Smaller SEM indicates more precise measurement. This is crucial for test interpretation and clinical decision-making.",
    "difficulty": "medium"
  },
  {
    "id": "assess-06",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Assessment Instruments",
    "stem": "The Rorschach Inkblot Test, when scored using the Exner Comprehensive System, is best classified as a:",
    "options": ["A. Projective personality inventory", "B. Performance-based personality measure", "C. Self-report measure", "D. Behavioral observation scale"],
    "correct_answer": "B. Performance-based personality measure",
    "explanation": "Contemporary psychologists increasingly refer to the Rorschach (particularly when scored with the Exner system or R-PAS) as a 'performance-based' measure rather than 'projective,' emphasizing that it assesses perceptual-cognitive processing through behavioral responses to ambiguous stimuli. This distinguishes it from self-report inventories (C) and pure behavioral observation (D).",
    "difficulty": "hard"
  },
  {
    "id": "assess-07",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Assessment Ethics",
    "stem": "When assessing a client from a culturally diverse background, a psychologist should FIRST:",
    "options": ["A. Use only culture-free tests", "B. Consider the appropriateness and potential bias of the assessment instruments", "C. Administer the standard battery and adjust interpretation afterward", "D. Decline to assess the client and refer to a same-culture provider"],
    "correct_answer": "B. Consider the appropriateness and potential bias of the assessment instruments",
    "explanation": "The APA Ethics Code and Standards for Educational and Psychological Testing require psychologists to consider the validity and potential bias of tests for the specific population being assessed. Truly 'culture-free' tests (A) do not exist. Simply adjusting interpretation afterward (C) may be insufficient. Automatic referral (D) is not always necessary or practical, though consultation may be appropriate.",
    "difficulty": "medium"
  },
  {
    "id": "assess-08",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Psychometrics",
    "stem": "Cronbach's alpha is a measure of:",
    "options": ["A. Inter-rater reliability", "B. Test-retest reliability", "C. Internal consistency reliability", "D. Parallel forms reliability"],
    "correct_answer": "C. Internal consistency reliability",
    "explanation": "Cronbach's alpha assesses internal consistency — the degree to which items on a test measure the same construct. It is essentially the average of all possible split-half correlations. Values range from 0 to 1, with .70-.80 considered acceptable for research and .90+ for clinical decisions. Inter-rater reliability (A) uses Cohen's kappa or ICC. Test-retest (B) uses Pearson correlation.",
    "difficulty": "easy"
  },
  {
    "id": "assess-09",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "DSM-5 Criteria",
    "stem": "In the DSM-5, which of the following is a key change from the DSM-IV?",
    "options": ["A. The multiaxial system was retained and expanded", "B. The multiaxial system was eliminated in favor of a nonaxial approach", "C. Personality disorders were moved to a separate classification system", "D. The GAF scale was elevated to a required component"],
    "correct_answer": "B. The multiaxial system was eliminated in favor of a nonaxial approach",
    "explanation": "A major change in the DSM-5 was the elimination of the multiaxial system (Axes I-V). All diagnoses are now listed together without axis distinctions. The GAF (Global Assessment of Functioning) scale was dropped (not elevated). Personality disorders remained in the main text, though an alternative model was placed in Section III.",
    "difficulty": "medium"
  },
  {
    "id": "assess-10",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Validity",
    "stem": "A psychological test that predicts future job performance demonstrates:",
    "options": ["A. Concurrent validity", "B. Predictive validity", "C. Content validity", "D. Face validity"],
    "correct_answer": "B. Predictive validity",
    "explanation": "Predictive validity (a type of criterion-related validity) refers to how well test scores predict future outcomes or criteria. If a test administered at hiring correlates with later job performance ratings, it has predictive validity. Concurrent validity (A) involves correlation with a criterion measured at the same time. Content validity (C) involves item representativeness. Face validity (D) is surface appearance.",
    "difficulty": "easy"
  },
  {
    "id": "assess-11",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Assessment Instruments",
    "stem": "On the MMPI-2, an elevated score on Scale 4 (Pd — Psychopathic Deviate) is most associated with:",
    "options": ["A. Somatic complaints and health anxiety", "B. Social introversion and withdrawal", "C. Authority conflicts, impulsivity, and antisocial behavior", "D. Paranoid ideation and suspiciousness"],
    "correct_answer": "C. Authority conflicts, impulsivity, and antisocial behavior",
    "explanation": "Scale 4 (Pd) on the MMPI-2 reflects antisocial behavior, rebelliousness, authority conflicts, impulsivity, and family discord. Somatic complaints (A) are associated with Scales 1 (Hs) and 3 (Hy). Social introversion (B) is Scale 0 (Si). Paranoid ideation (D) is Scale 6 (Pa).",
    "difficulty": "medium"
  },
  {
    "id": "assess-12",
    "domain": "Assessment and Diagnosis",
    "domain_num": 5,
    "topic": "Psychometrics",
    "stem": "A test with a sensitivity of 90% and specificity of 80% will:",
    "options": ["A. Correctly identify 90% of those with the condition and 80% of those without it", "B. Correctly identify 80% of those with the condition and 90% of those without it", "C. Have a false positive rate of 90%", "D. Have a positive predictive value of 90%"],
    "correct_answer": "A. Correctly identify 90% of those with the condition and 80% of those without it",
    "explanation": "Sensitivity (true positive rate) is the probability of correctly identifying those with the condition (90%). Specificity (true negative rate) is the probability of correctly identifying those without the condition (80%). The false positive rate would be 1 - specificity = 20%. Positive predictive value depends on base rate and cannot be determined from sensitivity/specificity alone.",
    "difficulty": "hard"
  },
  {
    "id": "treat-01",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "CBT",
    "stem": "The central ingredient of the most effective behavioral treatment for agoraphobia is:",
    "options": ["A. Systematic desensitization", "B. Prolonged exposure in vivo", "C. Cognitive restructuring", "D. Relaxation training"],
    "correct_answer": "B. Prolonged exposure in vivo",
    "explanation": "Research consistently supports prolonged in vivo (real-life) exposure as the most effective behavioral treatment for agoraphobia. While systematic desensitization (A) uses imaginal exposure with relaxation, in vivo exposure is more effective. Cognitive restructuring (C) is a cognitive technique. Relaxation training (D) alone is insufficient for agoraphobia treatment.",
    "difficulty": "medium"
  },
  {
    "id": "treat-02",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "DBT",
    "stem": "Dialectical Behavior Therapy (DBT) was originally developed by Marsha Linehan primarily for the treatment of:",
    "options": ["A. Generalized anxiety disorder", "B. Borderline personality disorder", "C. Obsessive-compulsive disorder", "D. Schizophrenia"],
    "correct_answer": "B. Borderline personality disorder",
    "explanation": "DBT was developed by Marsha Linehan specifically for chronically suicidal individuals with borderline personality disorder (BPD). It integrates cognitive-behavioral techniques with mindfulness and acceptance strategies. The four modules are mindfulness, distress tolerance, emotion regulation, and interpersonal effectiveness. It has since been adapted for other disorders.",
    "difficulty": "easy"
  },
  {
    "id": "treat-03",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Psychodynamic",
    "stem": "In psychoanalytic theory, transference refers to:",
    "options": ["A. The therapist's unconscious reactions to the client", "B. The client's projection of feelings about significant others onto the therapist", "C. The transfer of learning from therapy to real life", "D. The shift from one defense mechanism to another"],
    "correct_answer": "B. The client's projection of feelings about significant others onto the therapist",
    "explanation": "Transference occurs when a client unconsciously redirects feelings, attitudes, and expectations from significant past relationships onto the therapist. The therapist's unconscious reactions to the client (A) is countertransference. Transfer of learning (C) is generalization. Defense mechanism shifts (D) is not a standard psychoanalytic concept.",
    "difficulty": "easy"
  },
  {
    "id": "treat-04",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Motivational Interviewing",
    "stem": "In motivational interviewing, the technique of 'rolling with resistance' means:",
    "options": ["A. Confronting the client's denial directly", "B. Avoiding arguing and instead exploring the client's perspective", "C. Setting firm boundaries when the client is noncompliant", "D. Providing psychoeducation to overcome resistance"],
    "correct_answer": "B. Avoiding arguing and instead exploring the client's perspective",
    "explanation": "Rolling with resistance is a core principle of motivational interviewing (Miller & Rollnick) in which the therapist avoids confrontation and instead acknowledges the client's ambivalence, reframes statements, and invites new perspectives. Direct confrontation (A) tends to increase resistance. The goal is to evoke the client's own motivations for change.",
    "difficulty": "medium"
  },
  {
    "id": "treat-05",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Evidence-Based Practice",
    "stem": "According to the APA Presidential Task Force on Evidence-Based Practice, evidence-based practice in psychology (EBPP) integrates:",
    "options": ["A. Only randomized controlled trial results", "B. Best available research, clinical expertise, and patient characteristics/preferences", "C. Clinical intuition and theoretical orientation", "D. Manualized treatments exclusively"],
    "correct_answer": "B. Best available research, clinical expertise, and patient characteristics/preferences",
    "explanation": "The APA (2006) defined EBPP as the integration of the best available research with clinical expertise in the context of patient characteristics, culture, and preferences. This three-legged model recognizes that research alone (A) is insufficient, clinical intuition alone (C) is inadequate, and manualized treatments (D) must be adapted to individual clients.",
    "difficulty": "medium"
  },
  {
    "id": "treat-06",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "CBT",
    "stem": "Aaron Beck's cognitive therapy for depression focuses primarily on identifying and modifying:",
    "options": ["A. Unconscious conflicts and defense mechanisms", "B. Irrational beliefs and unconditional 'shoulds'", "C. Automatic thoughts, cognitive distortions, and core beliefs", "D. Conditioned emotional responses through exposure"],
    "correct_answer": "C. Automatic thoughts, cognitive distortions, and core beliefs",
    "explanation": "Beck's cognitive therapy targets the cognitive triad (negative views of self, world, and future) through identification and modification of automatic thoughts, cognitive distortions, and underlying core beliefs/schemas. Unconscious conflicts (A) are psychoanalytic. Irrational beliefs (B) are from Ellis's REBT. Conditioned responses (D) are behavioral.",
    "difficulty": "easy"
  },
  {
    "id": "treat-07",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Supervision",
    "stem": "The 'discrimination model' of clinical supervision (Bernard) involves the supervisor shifting between three roles. These roles are:",
    "options": ["A. Parent, adult, and child", "B. Teacher, counselor, and consultant", "C. Expert, collaborator, and evaluator", "D. Coach, mentor, and gatekeeper"],
    "correct_answer": "B. Teacher, counselor, and consultant",
    "explanation": "Bernard's discrimination model identifies three supervisor roles (teacher, counselor, consultant) applied across three focus areas (intervention, conceptualization, personalization). The supervisor selects the role that best matches the supervisee's needs in the moment. Parent/adult/child (A) is from transactional analysis.",
    "difficulty": "hard"
  },
  {
    "id": "treat-08",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Treatment Approaches",
    "stem": "Systematic desensitization, developed by Joseph Wolpe, is based on the principle of:",
    "options": ["A. Operant conditioning", "B. Reciprocal inhibition", "C. Cognitive restructuring", "D. Paradoxical intention"],
    "correct_answer": "B. Reciprocal inhibition",
    "explanation": "Systematic desensitization is based on Wolpe's principle of reciprocal inhibition — the idea that anxiety and relaxation are mutually exclusive states. By pairing anxiety-provoking stimuli (presented in a hierarchy) with relaxation, the anxiety response is inhibited. It involves three steps: relaxation training, hierarchy construction, and graduated pairing.",
    "difficulty": "medium"
  },
  {
    "id": "treat-09",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Treatment Approaches",
    "stem": "The 'common factors' model of psychotherapy suggests that therapeutic outcomes are most influenced by:",
    "options": ["A. The specific techniques used in therapy", "B. Factors shared across therapies such as the therapeutic alliance", "C. The therapist's theoretical orientation", "D. The number of sessions attended"],
    "correct_answer": "B. Factors shared across therapies such as the therapeutic alliance",
    "explanation": "The common factors model (Wampold, Frank, Lambert) suggests that variables common to all therapies — therapeutic alliance, empathy, positive regard, client expectations — account for more outcome variance than specific techniques. Lambert's research estimated that the therapeutic relationship accounts for about 30% of outcome variance, while specific techniques account for about 15%.",
    "difficulty": "medium"
  },
  {
    "id": "treat-10",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Prevention",
    "stem": "A school-based program designed to teach coping skills to ALL students to prevent the development of depression is an example of:",
    "options": ["A. Indicated prevention", "B. Selective prevention", "C. Universal prevention", "D. Tertiary prevention"],
    "correct_answer": "C. Universal prevention",
    "explanation": "Universal prevention targets the entire population regardless of risk level. Selective prevention (B) targets subgroups with known risk factors. Indicated prevention (A) targets individuals showing early signs of a disorder. Tertiary prevention (D) aims to reduce the impact of an existing disorder (essentially treatment/rehabilitation).",
    "difficulty": "medium"
  },
  {
    "id": "treat-11",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Psychodynamic",
    "stem": "In object relations theory, 'splitting' refers to:",
    "options": ["A. The division of the mind into id, ego, and superego", "B. The tendency to view people and situations as entirely good or entirely bad", "C. The separation of affect from cognitive content", "D. The therapist's use of two different therapeutic approaches"],
    "correct_answer": "B. The tendency to view people and situations as entirely good or entirely bad",
    "explanation": "Splitting is a primitive defense mechanism in object relations theory (Kernberg, Klein) where the individual cannot integrate positive and negative qualities of self and others, instead seeing them as all-good or all-bad. It is considered characteristic of borderline personality organization. The structural model (A) is Freud's tripartite theory. Separation of affect (C) is intellectualization/isolation.",
    "difficulty": "medium"
  },
  {
    "id": "treat-12",
    "domain": "Treatment, Intervention, Prevention and Supervision",
    "domain_num": 6,
    "topic": "Pharmacotherapy",
    "stem": "Lithium is considered the first-line pharmacological treatment for:",
    "options": ["A. Major depressive disorder", "B. Bipolar I disorder", "C. Generalized anxiety disorder", "D. Schizophrenia"],
    "correct_answer": "B. Bipolar I disorder",
    "explanation": "Lithium remains a first-line mood stabilizer for bipolar I disorder, particularly effective for managing manic episodes and preventing recurrence. It has also shown anti-suicidal properties. While antidepressants (not lithium) are first-line for MDD (A), anxiolytics for GAD (C), and antipsychotics for schizophrenia (D), lithium is uniquely suited for bipolar disorder.",
    "difficulty": "easy"
  },
  {
    "id": "research-01",
    "domain": "Research Methods and Statistics",
    "domain_num": 7,
    "topic": "Research Design",
    "stem": "A researcher wants to study the effect of a new teaching method on test scores. She randomly assigns students to either the new method or the traditional method. This is an example of a:",
    "options": ["A. Correlational study", "B. Quasi-experimental design", "C. True experimental design", "D. Case study"],
    "correct_answer": "C. True experimental design",
    "explanation": "A true experiment requires random assignment to conditions and manipulation of an independent variable. This study has both. A quasi-experiment (B) has manipulation but lacks random assignment. A correlational study (A) measures relationships without manipulation. A case study (D) is an in-depth study of one or few cases.",
    "difficulty": "easy"
  },
  {
    "id": "research-02",
    "domain": "Research Methods and Statistics",
    "domain_num": 7,
    "topic": "Statistics",
    "stem": "A researcher finds a correlation of r = -0.85 between hours of sleep and number of errors on a task. This indicates:",
    "options": ["A. A weak negative relationship", "B. A strong negative relationship", "C. A strong positive relationship", "D. No meaningful relationship"],
    "correct_answer": "B. A strong negative relationship",
    "explanation": "A correlation of r = -0.85 indicates a strong negative (inverse) relationship: as hours of sleep increase, errors decrease. The strength is determined by the absolute value (0.85 is strong), while the sign indicates direction. This does not imply causation — a third variable could explain the relationship.",
    "difficulty": "easy"
  },
  {
    "id": "research-03",
    "domain": "Research Methods and Statistics",
    "domain_num": 7,
    "topic": "ANOVA",
    "stem": "A one-way ANOVA is used when a researcher wants to:",
    "options": ["A. Compare means of two groups on one dependent variable", "B. Compare means of three or more groups on one dependent variable", "C. Examine the relationship between two continuous variables", "D. Compare proportions across categories"],
    "correct_answer": "B. Compare means of three or more groups on one dependent variable",
    "explanation": "A one-way ANOVA compares means across three or more groups (levels of one independent variable) on a single dependent variable. While it can technically be used with two groups (A), a t-test is preferred. Correlation/regression (C) examines relationships between continuous variables. Chi-square (D) compares proportions/frequencies.",
    "difficulty": "easy"
  },
  {
    "id": "research-04",
    "domain": "Research Methods and Statistics",
    "domain_num": 7,
    "topic": "Effect Size",
    "stem": "Cohen's d is a measure of effect size that represents:",
    "options": ["A. The proportion of variance explained", "B. The standardized difference between two group means", "C. The probability of correctly rejecting the null hypothesis", "D. The correlation between independent and dependent variables"],
    "correct_answer": "B. The standardized difference between two group means",
    "explanation": "Cohen's d expresses the difference between two means in standard deviation units. Cohen's conventions: d = 0.2 (small), 0.5 (medium), 0.8 (large). Proportion of variance explained (A) is eta-squared or R². Probability of rejecting the null (C) is statistical power. Correlation (D) is r.",
    "difficulty": "medium"
  },
  {
    "id": "research-05",
    "domain": "Research Methods and Statistics",
    "domain_num": 7,
    "topic": "Threats to Validity",
    "stem": "A test of adjustment is administered to 100 participants. Those scoring in the bottom 10% are selected for therapy. After therapy, they are retested and show improved scores. This improvement may best be explained by:",
    "options": ["A. The placebo effect", "B. Maturation", "C. Regression to the mean", "D. Practice effects"],
    "correct_answer": "C. Regression to the mean",
    "explanation": "When individuals are selected based on extreme scores, their subsequent scores tend to move toward the mean on retesting — this is regression to the mean (statistical regression). Those selected for extremely low scores likely had some measurement error pushing their scores down; on retest, this error is unlikely to be as extreme. This is a major threat to internal validity in pre-post designs without control groups.",
    "difficulty": "medium"
  },
  {
    "id": "research-06",
    "domain": "Research Methods and Statistics",
    "domain_num": 7,
    "topic": "Research Design",
    "stem": "A Type I error occurs when:",
    "options": ["A. The null hypothesis is incorrectly rejected", "B. The null hypothesis is incorrectly retained", "C. The sample size is too small", "D. The effect size is too large"],
    "correct_answer": "A. The null hypothesis is incorrectly rejected",
    "explanation": "A Type I error (alpha error, false positive) occurs when the null hypothesis is true but is incorrectly rejected — concluding there is an effect when there isn't one. A Type II error (B, beta error, false negative) occurs when the null hypothesis is false but is incorrectly retained. The probability of Type I error is controlled by alpha level (typically .05).",
    "difficulty": "easy"
  },
  {
    "id": "research-07",
    "domain": "Research Methods and Statistics",
    "domain_num": 7,
    "topic": "Regression",
    "stem": "In multiple regression, multicollinearity refers to:",
    "options": ["A. A nonlinear relationship between the predictor and outcome", "B. High correlation among predictor variables", "C. Unequal variance across levels of the predictor", "D. Non-normal distribution of residuals"],
    "correct_answer": "B. High correlation among predictor variables",
    "explanation": "Multicollinearity occurs when two or more predictor (independent) variables in a multiple regression are highly correlated with each other. This makes it difficult to determine the unique contribution of each predictor and inflates standard errors of regression coefficients. Unequal variance (C) is heteroscedasticity. Non-normal residuals (D) violate the normality assumption.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-01",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "APA Ethics Code",
    "stem": "According to the APA Ethics Code, when a psychologist's ethical responsibilities conflict with law, regulations, or other governing legal authority, the psychologist should:",
    "options": ["A. Always follow the law over the ethics code", "B. Always follow the ethics code over the law", "C. Make known their commitment to the Ethics Code and take steps to resolve the conflict responsibly", "D. Withdraw from the professional situation entirely"],
    "correct_answer": "C. Make known their commitment to the Ethics Code and take steps to resolve the conflict responsibly",
    "explanation": "Standard 1.02 of the APA Ethics Code states that when conflicts exist between ethical responsibilities and law, psychologists should make known their commitment to the Ethics Code and take steps to resolve the conflict in a responsible manner. If unresolvable, they may adhere to the law, but should not simply ignore the ethical issue.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-02",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Tarasoff",
    "stem": "The Tarasoff v. Regents of the University of California (1976) decision established that:",
    "options": ["A. Psychologists cannot be held liable for a client's violent acts", "B. Psychologists have a duty to protect identifiable potential victims when a client poses a serious threat", "C. All therapy communications are absolutely privileged", "D. Involuntary commitment requires two independent evaluations"],
    "correct_answer": "B. Psychologists have a duty to protect identifiable potential victims when a client poses a serious threat",
    "explanation": "The Tarasoff II (1976) ruling established a 'duty to protect' — when a therapist determines a patient poses a serious danger to an identifiable third party, they have an obligation to use reasonable care to protect the potential victim. This may include warning the victim, notifying police, or taking other reasonable steps. This was an expansion from the 1974 Tarasoff I 'duty to warn.'",
    "difficulty": "easy"
  },
  {
    "id": "ethics-03",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "HIPAA",
    "stem": "Under HIPAA, 'protected health information' (PHI) includes:",
    "options": ["A. Only information stored in electronic medical records", "B. Any individually identifiable health information transmitted or maintained in any form", "C. Only diagnostic codes and treatment plans", "D. Only information shared between healthcare providers"],
    "correct_answer": "B. Any individually identifiable health information transmitted or maintained in any form",
    "explanation": "HIPAA's Privacy Rule defines PHI as any individually identifiable health information held or transmitted in any form — electronic, paper, or oral. This includes demographics, diagnoses, treatment information, and payment data that can be linked to a specific individual. The Security Rule specifically addresses electronic PHI (ePHI), but PHI is broader than electronic records alone.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-04",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Dual Relationships",
    "stem": "According to the APA Ethics Code, a multiple relationship that would not reasonably be expected to cause impairment or risk exploitation:",
    "options": ["A. Is strictly prohibited in all cases", "B. Is not unethical but requires careful consideration", "C. Must be reported to the state licensing board", "D. Requires written permission from the client's attorney"],
    "correct_answer": "B. Is not unethical but requires careful consideration",
    "explanation": "Standard 3.05 of the APA Ethics Code recognizes that not all multiple relationships are avoidable or harmful. Multiple relationships that would not reasonably be expected to cause impairment of the psychologist's objectivity, competence, or effectiveness, or to risk exploitation or harm, are not unethical. However, psychologists must exercise careful judgment.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-05",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Informed Consent",
    "stem": "Informed consent for psychotherapy must include all of the following EXCEPT:",
    "options": ["A. Nature and anticipated course of therapy", "B. Fees and billing arrangements", "C. A guarantee of specific therapeutic outcomes", "D. Limits of confidentiality"],
    "correct_answer": "C. A guarantee of specific therapeutic outcomes",
    "explanation": "Informed consent requires informing clients about the nature of therapy, fees, confidentiality limits, and their rights. Psychologists should NEVER guarantee specific outcomes (C), as this would be misleading and unethical. Standard 10.01 requires providing reasonable opportunity to ask questions about treatment.",
    "difficulty": "easy"
  },
  {
    "id": "ethics-06",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Confidentiality",
    "stem": "A psychologist is subpoenaed to provide therapy records in a court proceeding. The most appropriate first step is to:",
    "options": ["A. Immediately provide all requested records to the court", "B. Destroy records that might be damaging to the client", "C. Assert privilege on behalf of the client and seek to limit disclosure", "D. Refuse the subpoena entirely without further action"],
    "correct_answer": "C. Assert privilege on behalf of the client and seek to limit disclosure",
    "explanation": "When subpoenaed, a psychologist should assert therapeutic privilege on the client's behalf and attempt to limit disclosure to only what is legally required. A subpoena alone does not require release of records — a court order may be needed. Providing all records immediately (A) may violate client confidentiality. Destroying records (B) is illegal. Simply refusing (D) may result in contempt of court.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-07",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "APA Ethics Code",
    "stem": "The five general principles of the APA Ethics Code are:",
    "options": ["A. Autonomy, beneficence, nonmaleficence, justice, and fidelity", "B. Beneficence and Nonmaleficence, Fidelity and Responsibility, Integrity, Justice, and Respect for People's Rights and Dignity", "C. Confidentiality, competence, consent, boundaries, and documentation", "D. Assessment, treatment, research, teaching, and supervision"],
    "correct_answer": "B. Beneficence and Nonmaleficence, Fidelity and Responsibility, Integrity, Justice, and Respect for People's Rights and Dignity",
    "explanation": "The APA Ethics Code contains five General Principles (aspirational): Beneficence and Nonmaleficence (Principle A), Fidelity and Responsibility (B), Integrity (C), Justice (D), and Respect for People's Rights and Dignity (E). These are aspirational, not enforceable like the Ethical Standards. Option A resembles Beauchamp and Childress's bioethics principles.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-08",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Professional Standards",
    "stem": "A psychologist realizes they are not competent to treat a client's specific presenting problem. According to the APA Ethics Code, they should:",
    "options": ["A. Continue treatment and learn as they go", "B. Refer the client or obtain appropriate training, consultation, or supervision", "C. Terminate treatment immediately without referral", "D. Treat the client but avoid documenting the areas of incompetence"],
    "correct_answer": "B. Refer the client or obtain appropriate training, consultation, or supervision",
    "explanation": "Standard 2.01 requires psychologists to practice within their boundaries of competence. When a client's needs exceed their competence, they should either refer the client, obtain appropriate training or consultation, or arrange supervision. Continuing without competence (A) or terminating without referral (C) would be unethical.",
    "difficulty": "easy"
  },
  {
    "id": "ethics-09",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Legal Issues",
    "stem": "In Jaffee v. Redmond (1996), the U.S. Supreme Court ruled that:",
    "options": ["A. Psychotherapy notes are not protected under any circumstances", "B. Communications between a therapist and client are protected by federal privilege", "C. Only psychiatrists, not psychologists, can claim therapeutic privilege", "D. States cannot create their own rules regarding therapist-client privilege"],
    "correct_answer": "B. Communications between a therapist and client are protected by federal privilege",
    "explanation": "In Jaffee v. Redmond (1996), the Supreme Court established that confidential communications between a psychotherapist (including licensed social workers) and a client are protected from compelled disclosure in federal court proceedings. This was a landmark ruling extending privilege to psychotherapy in the federal system.",
    "difficulty": "hard"
  },
  {
    "id": "ethics-10",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Confidentiality",
    "stem": "When working with a minor client, confidentiality generally:",
    "options": ["A. Does not apply at all since parents have full access to all information", "B. Is absolute and parents can never be informed about treatment", "C. Requires balancing the minor's privacy with parents' legal rights and the minor's best interests", "D. Only applies if the minor is over 16 years old"],
    "correct_answer": "C. Requires balancing the minor's privacy with parents' legal rights and the minor's best interests",
    "explanation": "Working with minors requires careful balancing of the minor's need for privacy, parents'/guardians' legal rights to information, and the minor's best interests. Best practice involves discussing confidentiality limits at the outset with both the minor and parents, including what will and won't be shared. Laws vary by state regarding minors' consent and privacy rights.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-11",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "APA Ethics Code",
    "stem": "According to the APA Ethics Code, sexual intimacies with a former therapy client are prohibited for a minimum of:",
    "options": ["A. 1 year after termination", "B. 2 years after termination", "C. 5 years after termination", "D. They are prohibited indefinitely"],
    "correct_answer": "B. 2 years after termination",
    "explanation": "Standard 10.08 prohibits sexual intimacies with former clients for at least 2 years after termination. Even after 2 years, such relationships are permissible only in the most unusual circumstances, and the psychologist must demonstrate no exploitation. In practice, many consider such relationships inadvisable at any time.",
    "difficulty": "easy"
  },
  {
    "id": "ethics-12",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Informed Consent",
    "stem": "For research involving deception, the APA Ethics Code requires that:",
    "options": ["A. Deception is never permitted in psychological research", "B. Participants must be debriefed as early as feasible and the deception must be justified by the study's value", "C. Deception is only acceptable in animal research", "D. Participants must sign a waiver agreeing to be deceived"],
    "correct_answer": "B. Participants must be debriefed as early as feasible and the deception must be justified by the study's value",
    "explanation": "Standard 8.07 allows deception in research only when: (1) the study has significant prospective scientific, educational, or applied value, (2) non-deceptive alternatives are not feasible, (3) participants are not deceived about aspects that would affect willingness to participate (e.g., physical pain or emotional distress), and (4) participants are debriefed as early as feasible.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-13",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Professional Standards",
    "stem": "Record keeping requirements under the APA Ethics Code specify that psychologists:",
    "options": ["A. Must keep records for exactly 7 years in all circumstances", "B. Create and maintain records in accordance with law and professional standards", "C. May destroy records immediately after termination if the client consents", "D. Only need to maintain records for clients with diagnosed mental disorders"],
    "correct_answer": "B. Create and maintain records in accordance with law and professional standards",
    "explanation": "Standard 6.01 requires psychologists to create, maintain, disseminate, store, retain, and dispose of records in accordance with law and the Ethics Code. Specific retention periods vary by state law (often 7 years for adults, longer for minors), but the APA Code does not specify a universal timeframe. Records serve clinical, legal, and ethical functions.",
    "difficulty": "medium"
  },
  {
    "id": "ethics-14",
    "domain": "Ethical, Legal, and Professional Issues",
    "domain_num": 8,
    "topic": "Legal Issues",
    "stem": "The least restrictive alternative doctrine in mental health law requires that:",
    "options": ["A. Patients be treated in the most intensive setting available", "B. Treatment be provided in the setting that restricts personal liberty the least while meeting treatment needs", "C. All patients receive outpatient treatment before hospitalization", "D. Insurance companies approve all levels of care"],
    "correct_answer": "B. Treatment be provided in the setting that restricts personal liberty the least while meeting treatment needs",
    "explanation": "The least restrictive alternative doctrine requires that when the state intervenes in a person's life (e.g., involuntary commitment), it must do so in the manner that least restricts the individual's liberty while still meeting legitimate treatment needs. This principle was reinforced in cases like Shelton v. Tucker (1960) and O'Connor v. Donaldson (1975).",
    "difficulty": "medium"
  }
]
